{{- if (eq .chezmoi.os "darwin") -}}
tap "homebrew/bundle"

#-------------
# fonts
#-------------
cask "font-go-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"

#-------------
# utilities
#-------------
brew "zsh"
brew "tmux"
brew "tree"

#-------------
# development tools
#-------------
brew "gh"
brew "jq"
brew "shfmt"
brew "btop"

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "appcleaner"
cask "brave-browser"
cask "jetbrains-toolbox"
cask "tiles"
cask "visual-studio-code"

#-------------
# vscode
#-------------

## themes
vscode "catppuccin.catppuccin-vsc-pack"

## linting/formatting
vscode "davidanson.vscode-markdownlint"
vscode "editorconfig.editorconfig"
vscode "mkhl.shfmt"
vscode "tamasfe.even-better-toml"
vscode "dbaeumer.vscode-eslint"

## languages
vscode "golang.go"
vscode "redhat.java"

## helpful utilities
vscode "eamodio.gitlens"
vscode "humao.rest-client"
{{ end -}}
